# Script to create a page of links to text files
import os.path
import re
from collections import OrderedDict


def get_files_by_author(file_list):
    re_name = re.compile('(.+?)(?:／.+?)?-(.+?)(?:\s*\(.+?)?\.(txt|html)', re.IGNORECASE)
    #re_name = re.compile('(.+?).(txt|html)', re.IGNORECASE)

    authors = OrderedDict()
    for file_name in file_list.split('\n'):
        stripped_name = file_name.strip()

        if len(stripped_name):
            m = re_name.match(stripped_name)
            if m is None:
                raise RuntimeError(stripped_name + ' is ill-formed')
            author = m.group(1)
            work_name = m.group(2)
            html_file_name = os.path.splitext(stripped_name)[0] + '.html'
            author_files = authors.setdefault(author, [])
            author_files.append((work_name, html_file_name))
    return authors


def get_file_links(base_dir, files_by_author):
    template = '   <li><a href="{base_dir}/{file_name}">{work_name}</a></li>\n'

    contents = ''
    for author, his_files in files_by_author.items():
        contents += '<h2>{}</h2>\n'.format(author)
        contents += '<div><a href="">Wikipedia</a></div>\n'
        contents += '<ul>\n'

        for work_name, html_file_name in his_files:
            list_item = template.format(base_dir=base_dir, file_name=html_file_name, work_name=work_name)
            contents += list_item

        contents += '</ul>\n'
    return contents


file_list = '''
なだいなだ-クレージイ・ドクターの回想.html
なだいなだ-パパのおくりもの.html
ニコル-Ｃ・Ｗ・ニコルの旅行記 (青空文庫対応txt 表紙付)(校正07-01-21)..html
ニコル-Ｃ・Ｗ・ニコルの自然記 (青空文庫対応txt 表紙付)(校正07-01-21)..html
ニコル-Ｃ・Ｗ・ニコルの野性記 (青空文庫対応txt 表紙付)(校正07-01-21)..html
バークレー-愛のサマーヴィル1 夢見た騎士.html
ハーバート-デューン・砂の惑星１.html
ハーバート-デューン・砂の惑星２.html
ハーバート-デューン・砂の惑星３.html
パール・バック／大久保康雄訳-大地（１部） (青空文庫対応txt)(校正08-12-11).html
パール・バック／大久保康雄訳-大地（２部） (青空文庫対応txt)(校正08-12-11).html
パール・バック／大久保康雄訳-大地（３部） (青空文庫対応txt)(校正08-12-11).html
ハーン／平井呈一訳-心 (青空文庫対応txt)(校正08-12-15).html
ハーン／平井呈一訳-東の国から (青空文庫対応txt)(校正09-06-01).html
ハーン／平井呈一訳-骨董 (青空文庫対応txt)(校正08-12-15).html
ハーン／斎藤正二訳-怪談（完訳） (青空文庫対応txt)(校正08-12-15).html
ハーン／田代三千稔訳-怪談・奇談.html
ハイネ／井上正蔵訳-ハイネ詩集 (青空文庫対応txt)(校正07-06-16).html
ハイヤーム／黒川恒男訳-ルバイヤート (青空文庫対応txt)(校正07-06-15).html
ハインライン-デリラと宇宙野郎たち (青空文庫txt形式).html
ハインライン-メトセラの子ら (青空文庫txt形式).html
ハインライン-動乱２１００ (青空文庫txt形式).html
ハインライン-地球の緑の丘 (青空文庫txt形式).html
ハインライン-夏への扉.html
ハインライン-宇宙の孤児 (青空文庫txt形式).html
ハインライン-宇宙の戦士 (青空文庫txt形式).html
ハインライン-愛に時間を1 (青空文庫txt形式).html
ハインライン-愛に時間を2 (青空文庫txt形式).html
ハインライン-月は無慈悲な夜の女王(青空文庫形式txt).html
ハシェク／辻恒彦訳-良き兵士シュベイク（上） (青空文庫対応txt)(校正07-06-13).html
ハシェク／辻恒彦訳-良き兵士シュベイク（下） (青空文庫対応txt)(校正07-06-13).html
ハックスリー／高畠文夫訳-すばらしい新世界 (青空文庫対応txt)(校正09-06-01).html
バットゥータ／前嶋信次訳-三大陸周遊記 (青空文庫対応txt)(校正09-01-15).html
ハドスン／守屋陽一訳-緑の館 (青空文庫対応txt)(校正09-01-12).html
ハドスン／水嶋正路訳-ある羊飼いの一生 (青空文庫対応txt)(校正09-01-12).html
はままさのり-青の騎士 ベルゼルガ物語 1 (青空文庫txt形式対応).html
はままさのり-青の騎士 ベルゼルガ物語 2 (青空文庫txt形式対応).html
ハミルトン-さすらいのスターウルフ.html
ハメット／宇野利泰訳-マルタの鷹 (青空文庫対応txt)(校正07-06-12).html
ハメット／村上啓夫訳-デイン家の呪い (青空文庫対応txt)(校正09-01-13).html
ハメット／田中融二訳-死刑は一回でたくさん (青空文庫対応txt)(校正09-01-13).html
ハメット／砧一郎訳-ガラスの鍵 (青空文庫対応txt)(校正09-01-13).html
ハメット／砧一郎訳-コンティネンタル・オプ (青空文庫対応txt)(校正09-01-13).html
ハメット／砧一郎訳-影なき男 (青空文庫対応txt)(校正07-06-12).html
ハメット／能島武文訳-血の収穫 (青空文庫対応txt)(校正09-01-13).html
バルザック／佐藤朔訳-従妹ベット（上） (青空文庫対応txt)(校正08-12-30).html
バルザック／佐藤朔訳-従妹ベット（下） (青空文庫対応txt)(校正08-12-30).html
バルザック／小西茂也訳-ゴリオ爺さん (青空文庫対応txt)(校正08-12-30).html
バルザック／小西茂也訳-風流滑稽譚（第一輯）.html
バルザック／小西茂也訳-風流滑稽譚（第三輯）.html
バルザック／小西茂也訳-風流滑稽譚（第二輯）.html
バルザック／山口年臣訳-ウジェニー・グランデ (青空文庫対応txt)(校正08-12-30).html
バルザック／菅野昭正訳-谷間のゆり（上） (青空文庫対応txt)(校正08-12-30).html
バルザック／菅野昭正訳-谷間のゆり（下） (青空文庫対応txt)(校正08-12-30).html
バローズ／佐藤高子訳-ペルシダーに還る (青空文庫対応txt)(校正09-06-04).html
バローズ／佐藤高子訳-危機のペルシダー (青空文庫対応txt)(校正09-06-06).html
バローズ／佐藤高子訳-戦乱のペルシダー (青空文庫対応txt)(校正09-06-06).html
バローズ／南山宏訳-火星の合成人間 (青空文庫対応txt)(校正09-06-05).html
バローズ／小笠原豊樹訳-火星の大元帥カーター (青空文庫対応txt)(校正09-06-06).html
バローズ／小笠原豊樹訳-火星の女神イサス 火星の合成人間 (青空文庫対応txt)(校正09-06-05).html
バローズ／小西宏訳-火星のチェス人間 (青空文庫対応txt)(校正09-06-04).html
バローズ／小西宏訳-火星の交換頭脳 (青空文庫対応txt)(校正09-06-04).html
バローズ／小西宏訳-火星の幻兵団 (青空文庫対応txt)(校正09-06-04).html
バローズ／野田昌宏訳-火星の秘密暗殺団 (青空文庫対応txt)(校正09-06-06).html
バローズ／関口幸男訳-恐怖のペルシダー (青空文庫対応txt)(校正09-06-06).html
バローズ／関口幸男訳-栄光のペルシダー (青空文庫対応txt)(校正09-06-04).html
バローズ-地底世界ペルシダー (青空文庫対応txt)(校正07-09-04).html
バローズ-火星のプリンセス (青空文庫対応txt)(校正07-09-04).html
ビアス／奥田俊介・倉本護・猪狩博訳-悪魔の辞典.html
ピアズ・アンソニイ-魔法の国ザンス01～カメレオンの呪文～[ルビ有TXT版].html
ビアス-ビアス怪異譚（１） (青空文庫対応txt)(校正08-05-16).html
ビアス-ビアス怪異譚（２） (青空文庫対応txt)(校正08-05-16).html
ヒキタクニオ-ベリィ・タルト (青空文庫対応txt 表紙付)(校正08-11-19).html
ヒキタクニオ-消し屋Ａ (青空文庫対応txt 表紙付)(校正08-11-19).html
ヒルトン／菊池重三郎訳-チップス先生さようなら (青空文庫対応txt)(校正09-01-17).html
ヒロシ-ヒロシです。(ルビ無しtxt)(校正06-06-26).html
ヒロシ-ヒロシです。２(ルビ無しtxt)(校正06-06-26).html
フィッツジェラルド／佐藤亮一訳-華麗なるギャツビー (青空文庫対応txt)(校正08-12-11).html
フィッツジェラルド／大貫三郎訳-華麗なるギャツビー.html
フィッツジェラルド／守屋陽一訳-雨の朝パリに死す (青空文庫対応txt)(校正08-12-11).html
フィッツジェラルド／野崎孝訳-グレート・ギャツビー (ルビ無しtxt).html
フィルポッツ／井内雄四郎訳-闇からの声 (青空文庫対応txt)(校正09-01-13).html
フィルポッツ／赤冬子訳-赤毛のレッドメーン家 (青空文庫対応txt)(校正09-01-13).html
プーシキン／中村白葉訳-大尉の娘.html
プーシキン／高橋包子訳-スペードの女王・大尉の娘 (青空文庫対応txt)(校正08-12-17).html
フーリック／大室幹雄訳-中国梵鐘殺人事件 (青空文庫対応txt)(校正09-05-30).html
フーリック／大室幹雄訳-中国湖水殺人事件 (青空文庫対応txt)(校正09-05-30).html
フーリック／大室幹雄訳-中国迷路殺人事件 (青空文庫対応txt)(校正09-05-30).html
フーリック／大室幹雄訳-中国鉄釘殺人事件 (青空文庫対応txt)(校正09-05-30).html
フーリック／大室幹雄訳-中国黄金殺人事件 (青空文庫対応txt)(校正09-05-30).html
フォス-日本の父へ.html
ブラウン-天の光はすべて星.html
プラトン／戸塚七郎訳-饗宴 (青空文庫対応txt)(校正08-12-29).html
フランス／岡野馨訳-舞姫タイス (青空文庫対応txt)(校正09-01-11).html
フリーマン／大久保康雄訳-歌う白骨 (青空文庫対応txt)(校正08-12-31).html
ブリン-サンダイバー(青空文庫形式txt).html
プレヴォ／鈴木豊訳-マノン・レスコオ (青空文庫対応txt)(校正09-01-13).html
フレーザー／永橋卓介訳-悪魔の弁護人 (青空文庫対応txt)(校正09-05-30).html
フレーザー／青江舜二郎訳-火の起原の神話 (青空文庫対応txt)(校正09-05-30).html
フロイト／渡辺哲夫訳-モーセと一神教 (青空文庫対応txt)(校正09-06-09).html
フロイト／生松敬三訳-フロイト自伝 (青空文庫対応txt 表紙付)(校正09-03-16).html
フロイト／高橋義孝訳-芸術論.html
フローベール／白井浩司訳-ボヴァリー夫人 (青空文庫対応txt)(校正08-12-14).html
ブロック-アーカム計画(青空文庫形式txt).html
ヘッセ／佐藤晃一訳-郷愁 (青空文庫対応txt)(校正08-12-12).html
ヘッセ／岩淵達治訳-車輪の下 (青空文庫対応txt)(校正08-12-12).html
ヘッセ／常木実訳-デーミアン (青空文庫対応txt)(校正08-12-12).html
ヘッセ／永野藤夫訳-知と愛 (青空文庫対応txt)(校正09-01-16).html
ヘッセ／永野藤夫訳-荒野の狼 (青空文庫対応txt)(校正08-12-12).html
ヘッセ／芳賀檀訳-漂泊の人（クヌルプ） (青空文庫対応txt)(校正08-12-12).html
ヘッセ／高橋健二訳-ガラス玉演戯（上） (青空文庫対応txt)(校正08-12-12).html
ヘッセ／高橋健二訳-ガラス玉演戯（下） (青空文庫対応txt)(校正08-12-12).html
ヘッセ／高橋健二訳-車輪の下 (青空文庫対応txt)(校正08-12-22).html
ヘディン／岩村忍訳-さまよえる湖 (青空文庫対応txt)(校正07-06-13).html
ヘディン／岩村忍訳-中央アジア探検記 (青空文庫対応txt)(校正09-01-13).html
ヘディン／長尾宏也訳-シルクロード (青空文庫対応txt)(校正09-01-13).html
ペトロニウス／岩崎良三訳-サテュリコン (青空文庫対応txt)(校正08-12-31).html
ベニー松山-終末をもたらす者 (Sa･Ga FrontierⅡ)(ルビ無しテキスト 改行修正版).html
ベニー松山-隣り合わせの灰と青春.html
ベニー松山-風よ。龍に届いているか（上）.html
ベニー松山-風よ。龍に届いているか（下）.html
ヘミングウェー／永井淳訳-危険な夏 (青空文庫対応txt)(校正09-01-16).html
ヘミングウェー／福田恆存訳-老人と海.html
ヘミングウェー／高村勝治訳-われらの時代に／ヘミングウェー短編集１ (青空文庫対応txt)(校正08-12-31).html
ヘミングウェー／高村勝治訳-勝者には何もやるな／ヘミングウェー短編集３ (青空文庫対応txt)(校正08-12-31).html
ヘミングウェー／高村勝治訳-女のいない男たち／ヘミングウェー短編集２ (青空文庫対応txt)(校正08-12-31).html
ヘミングウェー／高村勝治訳-日はまた昇る (青空文庫対応txt)(校正09-01-16).html
ヘミングウェー／高村勝治訳-武器よさらば (青空文庫対応txt)(校正08-12-06).html
ベルグ／行方未知訳-イマージュ (青空文庫対応txt 表紙付)(校正09-03-11).html
ベルナノス-田舎司祭の日記.html
ベレアーズ-(ルイスと魔法使い協会1)壁のなかの時計(TXT).html
ベレアーズ-(ルイスと魔法使い協会２)闇にひそむ影(TXT).html
ベレアーズ-(ルイスと魔法使い協会４)鏡のなかの幽霊(TXT).html
ベレアーズ-(ルイスと魔法使い協会７)魔法博物館の謎(TXT).html
ペロー-ペロー童話集(眠れる森の美女・赤ずきんちゃん・シンデレラ 他) (青空文庫txt形式)(校正07-06-04).html
ベンダサン-日本人とユダヤ人.html
ベントリー／宇野利泰訳-トレント最後の事件 (青空文庫対応txt)(校正08-12-31).html
ポー／佐々木直次郎訳-アッシャー家の崩壊 (青空文庫対応txt)(校正07-06-02).html
ポー／八木敏雄訳-ポオのＳＦ 第１巻 (青空文庫対応txt)(校正09-05-30).html
ポー／八木敏雄訳-ポオのＳＦ 第２巻 (青空文庫対応txt)(校正09-05-30).html
ポー／安引宏・佐々木直次郎訳-黒猫・黄金虫 (青空文庫対応txt)(校正07-06-02).html
ポー／安引宏訳-モルグ街の殺人 (青空文庫対応txt)(校正07-06-02).html
ポー／西村孝次訳-黒猫・黄金虫 他.html
ホーガン-ガニメデの優しい巨人.html
ホーガン-創世記機械械.html
ホーガン-巨人たちの星(青空文庫形式txt).html
ホーガン-星を継ぐもの.html
ホーソン／刈田元司訳-スカーレット・レター(緋文字) (青空文庫対応txt)(校正09-01-15).html
ホーソン／鈴木武雄訳-七破風の屋敷 (青空文庫対応txt)(校正09-01-13).html
ボードレール／村上菊一郎訳-パリの憂鬱 (青空文庫対応txt)(校正09-01-16).html
ボーマルシェ／辰野隆訳-フィガロの結婚 (青空文庫対応txt)(校正09-01-11).html
ボッカッチョ／柏熊達生訳-デカメロン（上） (青空文庫対応txt)(校正09-01-16).html
ボッカッチョ／柏熊達生訳-デカメロン（下） (青空文庫対応txt)(校正09-01-16).html
ボッカッチョ／柏熊達生訳-デカメロン（中） (青空文庫対応txt)(校正09-01-16).html
ホメロス／呉茂一訳-イリアス（上） (青空文庫対応txt)(校正08-12-15).html
ホメロス／呉茂一訳-イリアス（下） (青空文庫対応txt)(校正08-12-15).html
ホメロス／呉茂一訳-オデュッセイア（上） (青空文庫対応txt)(校正08-12-15).html
ホメロス／呉茂一訳-オデュッセイア（下） (青空文庫対応txt)(校正08-12-15).html
マーフィ-(ミルドレッドの魔女学校シリーズ１)魔女学校の一年生.html
マーフィ-(ミルドレッドの魔女学校シリーズ２)魔女学校の転校生.html
マーフィ-(ミルドレッドの魔女学校シリーズ３)どじ魔女ミルの大てがら.html
マーフィ-(ミルドレッドの魔女学校シリーズ４)魔女学校、海へいく.html
マゾッホ／小野武雄訳-毛皮を着たヴィーナス (青空文庫対応txt)(校正07-06-12).html
マッカラーズ／河野一郎訳-心は孤独な狩人 (青空文庫対応txt)(校正09-06-07).html
マルコ・ポーロ／青木富太郎訳-東方見聞録 (青空文庫対応txt)(校正08-12-31).html
マン／佐藤晃一訳-トーマス・マン短編集１ (青空文庫対応txt)(校正09-11-04).html
マン／佐藤晃一訳-トーマス・マン短編集２ (青空文庫対応txt)(校正09-11-04).html
マン／植田敏郎訳-ヴェニスに死す (青空文庫対応txt)(校正08-12-08).html
マン／植田敏郎訳-トーニオ・クレーガー (青空文庫対応txt)(校正08-12-08).html
マン／高橋義孝訳-トニオ・クレーゲル／ヴェニスに死す.html
マンスフィールド／江上照彦訳-園遊会 (青空文庫対応txt)(校正09-01-11).html
ミュッセ／山本泰三訳-ガミアニ夫人 (青空文庫対応txt)(校正09-01-13).html
ミラー／大久保康雄訳-南回帰線（上） (青空文庫対応txt)(校正08-12-06).html
ミラー／大久保康雄訳-南回帰線（下） (青空文庫対応txt)(校正08-12-06).html
ミルン／古賀照一訳-赤い館の秘密 (青空文庫対応txt)(校正07-06-15).html
むぅ-「未来に向かって」.html
むぅ-Happiness.html
メイスン／守屋陽一訳-矢の家 (青空文庫対応txt)(校正09-01-11).html
メーテルリンク／鈴木豊訳-青い鳥 (青空文庫対応txt)(校正08-12-17).html
メリメ／江口清訳-カルメン (青空文庫対応txt)(校正09-01-13).html
メルヴィル／柴田元幸訳-書写人バートルビー.html
モーパッサン／新庄嘉章--ある女の告白 (青空文庫対応txt)(校正08-12-12).html
モーパッサン／木村庄三郎訳-脂肪の塊・テリエ楼 (青空文庫対応txt)(校正08-12-12).html
モーパッサン／杉捷夫訳-くびかざり (青空文庫対応txt)(校正09-11-04).html
モーパッサン／杉捷夫訳-シモンのパパ (青空文庫対応txt)(校正09-11-04).html
モーパッサン／杉捷夫訳-ピエールとジャン (青空文庫対応txt)(校正09-01-16).html
モーパッサン／榊原晃三訳-モーパッサン怪奇傑作集 (青空文庫対応txt)(校正08-12-12).html
モーム／中野好夫訳-月と六ペンス.html
モーム／北川悌二訳-人間の絆（上） (青空文庫対応txt)(校正08-12-12).html
モーム／北川悌二訳-人間の絆（下） (青空文庫対応txt)(校正08-12-12).html
モーム／田中西二郎訳-モーム短編集「園遊会まで」 (青空文庫対応txt)(校正08-12-12).html
モーム／田中西二郎訳-ロータス・イーター (青空文庫対応txt)(校正09-01-15).html
モーム／田中西二郎訳-幸福 (青空文庫対応txt)(校正09-01-15).html
モーム／篠原慎訳-諜報員アシェンデン (青空文庫対応txt)(校正09-01-15).html
モーム／西村孝次訳-モーム短編集「手紙」 (青空文庫対応txt)(校正08-12-12).html
モーム／龍口直太郎訳-月と六ペンス (青空文庫対応txt)(校正08-12-12).html
モリエール／鈴木豊訳-商人貴族 (青空文庫対応txt)(校正08-12-17).html
もりたなるお-土俵に棲む鬼 相撲小説集 (青空文庫対応txt 表紙付)(校正07-12-20)(1).html
もりたなるお-金星 相撲小説集 (青空文庫対応txt 表紙付)(校正07-12-20).html
モンゴメリ／神山妙子訳-赤毛のアン (青空文庫対応txt)(校正08-12-12).html
ヤマグチノボル-ゼロの使い魔 外伝 タバサの冒険 1(青空文庫txt形式)[挿絵有](校正07-05-23)(軽量化).html
ヤマグチノボル-ゼロの使い魔 外伝 タバサの冒険 2.html
ヤマグチノボル-ゼロの使い魔 番外編 ティファニアの悩み.html
ヤマグチノボル-ゼロの使い魔 番外編 ルイズのタルト.html
ヤマグチノボル-ゼロの使い魔 第01巻 (青空文庫形式txt 挿し絵付)(行抜けなど大幅修正 07-04-13).html
ヤマグチノボル-ゼロの使い魔 第02巻〈風のアルビオン〉.html
ヤマグチノボル-ゼロの使い魔 第03巻〈始祖の祈祷書〉.html
ヤマグチノボル-ゼロの使い魔 第04巻〈誓約の水精霊〉.html
ヤマグチノボル-ゼロの使い魔 第05巻〈トリスタニアの休日〉.html
ヤマグチノボル-ゼロの使い魔 第06巻〈贖罪の炎赤玉〉.html
ヤマグチノボル-ゼロの使い魔 第07巻 ＜銀の降臨祭＞ (青空文庫txt形式)[挿絵有](校正07-05-18).html
ヤマグチノボル-ゼロの使い魔 第08巻 ＜望郷の小夜曲＞ (青空文庫txt形式)[挿絵有](校正07-05-18).html
ヤマグチノボル-ゼロの使い魔 第10巻 ＜イーヴァルディの勇者＞ (青空文庫txt形式)[挿絵有](校正07-05-23)(軽量化).html
ヤマグチノボル-ゼロの使い魔 第11巻〈追憶の二重奏〉.html
ヤマグチノボル-ゼロの使い魔 第12巻＜妖精達の休日＞.html
ヤマグチノボル-ゼロの使い魔 第13巻(聖国の世界扉)l.html
ヤマグチノボル-ゼロの使い魔 第14巻 ＜水都市の聖女＞.html
ヤマグチノボル-ゼロの使い魔 第15巻 忘却の夢迷宮 (青空文庫txt).html
ヤマグチノボル-ゼロの使い魔 第16巻 ド・オルニエールの安穏 (txt).html
ヤマグチノボル-ゼロの使い魔 第17巻 黎明の修道女.html
ヤマグチノボル-ゼロの使い魔 第18巻 滅亡の精霊石.html
ユゴー／斎藤正直訳-レ・ミゼラブル（上） (青空文庫対応txt)(校正08-12-13).html
ユゴー／斎藤正直訳-レ・ミゼラブル（下） (青空文庫対応txt)(校正08-12-13).html
ユゴー／斎藤正直訳-死刑囚最後の日 (青空文庫対応txt)(校正08-12-13).html
ユゴー／榊原晃三訳-九十三年 (青空文庫対応txt)(校正09-01-11).html
ユゴー／辻昶・松下和則訳-ノートルダム・ド・パリ（上） (青空文庫対応txt)(校正08-12-13).html
ユゴー／辻昶・松下和則訳-ノートルダム・ド・パリ（下） (青空文庫対応txt)(校正08-12-13).html
ヨーヴィル-ドラッケンフェルズ.html
ヨネスケ（桂米助）-ごはん.html
ラヴクラフト全集0-00-各話あらすじ.html
ラヴクラフト全集1-00-目次★★★★★★★★★★★★.html
ラヴクラフト全集1-01-「インスマウスの影」.html
ラヴクラフト全集1-02-「壁のなかの鼠」.html
ラヴクラフト全集1-03-「死体安置所にて」.html
ラヴクラフト全集1-04-「闇に囁くもの」.html
ラヴクラフト全集1-05-「訳者あとがき」.html
ラヴクラフト全集2-00-目次★★★★★★★★★★★★.html
ラヴクラフト全集2-01-「クトゥルフの呼び声」.html
ラヴクラフト全集2-02-「エーリッヒ・ツァンの音楽」.html
ラヴクラフト全集2-03-「チャールズ・ウォードの奇怪な事件」-1-結末と序曲.html
ラヴクラフト全集2-04-「チャールズ・ウォードの奇怪な事件」-2-先人と妖異.html
ラヴクラフト全集2-05-「チャールズ・ウォードの奇怪な事件」-3-探査と招魂.html
ラヴクラフト全集2-06-「チャールズ・ウォードの奇怪な事件」-4-変容と狂気.html
ラヴクラフト全集2-07-「チャールズ・ウォードの奇怪な事件」-5-悪夢と消散.html
ラヴクラフト全集2-08-「訳者あとがき」.html
ラヴクラフト全集3-00-目次★★★★★★★★★★★★.html
ラヴクラフト全集3-01-「ダゴン」.html
ラヴクラフト全集3-02-「家のなかの絵」.html
ラヴクラフト全集3-03-「無名都市」.html
ラヴクラフト全集3-04-「潜み棲む恐怖」.html
ラヴクラフト全集3-05-「アウトサイダー」.html
ラヴクラフト全集3-06-「戸口にあらわれたもの」.html
ラヴクラフト全集3-07-「闇をさまようもの」.html
ラヴクラフト全集3-08-「時間からの影」.html
ラヴクラフト全集3-09-「資料：履歴書」.html
ラヴクラフト全集3-10-「作品解題 大瀧啓裕」.html
ラヴクラフト全集4-00-目次★★★★★★★★★★★★.html
ラヴクラフト全集4-01-「宇宙からの色」.html
ラヴクラフト全集4-02-「眠りの壁の彼方」.html
ラヴクラフト全集4-03-「故アーサー・ジャーミンとその家系に関する事実」.html
ラヴクラフト全集4-04-「冷気」.html
ラヴクラフト全集4-05-「彼方より」.html
ラヴクラフト全集4-06-「ピックマンのモデル」.html
ラヴクラフト全集4-07-「狂気の山脈にて」.html
ラヴクラフト全集4-08-「資料・怪奇小説の執筆について」.html
ラヴクラフト全集4-09-「作品解題 大瀧啓裕」.html
ラヴクラフト全集5-00-目次★★★★★★★★★★★★.html
ラヴクラフト全集5-01-「神殿」.html
ラヴクラフト全集5-02-「ナイアラルトホテップ」.html
ラヴクラフト全集5-03-「魔犬」.html
ラヴクラフト全集5-04-「魔宴」.html
ラヴクラフト全集5-05-「死体蘇生者ハーバート・ウェスト」.html
ラヴクラフト全集5-06-「レッド・フックの恐怖」.html
ラヴクラフト全集5-07-「魔女の家の夢」.html
ラヴクラフト全集5-08-「ダニッチの怪」.html
ラヴクラフト全集5-09-「資料『ネクロノミコン』の歴史」.html
ラヴクラフト全集5-10-「作品解題 大瀧啓裕」.html
ラヴクラフト全集6-00-目次★★★★★★★★★★★★.html
ラヴクラフト全集6-01-「白い帆船」.html
ラヴクラフト全集6-02-「ウルタールの猫」.html
ラヴクラフト全集6-03-「蕃神」.html
ラヴクラフト全集6-04-「セレファイス」.html
ラヴクラフト全集6-05-「ランドルフ・カーターの陳述」.html
ラヴクラフト全集6-06-「名状しがたいもの」.html
ラヴクラフト全集6-07-「銀の鍵」.html
ラヴクラフト全集6-08-「銀の鍵の門を越えて」.html
ラヴクラフト全集6-09-「未知なるカダスを夢に求めて」.html
ラヴクラフト全集6-10-「作品解題 大瀧啓裕」.html
ラヴクラフト全集7-00-目次★★★★★★★★★★★★.html
ラヴクラフト全集7-01-「サルナスの滅亡」.html
ラヴクラフト全集7-02-「イラノンの探求」.html
ラヴクラフト全集7-03-「木」.html
ラヴクラフト全集7-04-「北極星」.html
ラヴクラフト全集7-05-「月の湿原」.html
ラヴクラフト全集7-06-「緑の草原」.html
ラヴクラフト全集7-07-「眠りの神」.html
ラヴクラフト全集7-08-「あの男」.html
ラヴクラフト全集7-09-「忌み嫌われる家」.html
ラヴクラフト全集7-10-「霊廟」.html
ラヴクラフト全集7-11-「ファラオとともに幽閉されて」.html
ラヴクラフト全集7-12-「恐ろしい老人」.html
ラヴクラフト全集7-13-「霧の高みの不思議な家」.html
ラヴクラフト全集7-14-「初期作品」-「洞窟の獣」.html
ラヴクラフト全集7-15-「初期作品」-「錬金術師」.html
ラヴクラフト全集7-16-「初期作品」-「ファン・ロメロの変容」.html
ラヴクラフト全集7-17-「初期作品」-「通り」.html
ラヴクラフト全集7-18-「初期作品」-「詩と神々」.html
ラヴクラフト全集7-19-「夢書簡」.html
ラヴクラフト全集7-20-「資料：断片」-「アザトホース」.html
ラヴクラフト全集7-21-「資料：断片」-「末裔」.html
ラヴクラフト全集7-22-「資料：断片」-「本」.html
ラヴクラフト全集7-23-「作品解題 大瀧啓裕」.html
ラッセル／日高一輝訳-幸福の獲得について (青空文庫対応txt)(校正09-06-03).html
ラディゲ／江口清訳-肉体の悪魔 (青空文庫対応txt)(校正08-12-12).html
ラム／平井正穂訳-エリア随筆 (青空文庫対応txt)(校正09-06-03).html
ラム／松本恵子訳-シェイクスピア物語 (青空文庫対応txt)(校正09-01-11).html
ランボー／篠沢秀夫訳-地獄での一季節 (青空文庫対応txt)(校正09-06-01).html
ランボー／金子光晴訳-イリュミナシオン.html
リラダン-殘酷物語.html
リルケ／星野慎一訳-マルテの手記 (青空文庫対応txt)(校正09-01-16).html
リルケ／石丸静雄訳-リルケ詩集 (青空文庫対応txt)(校正09-06-01).html
ルイス／瀬田貞二訳-(ナルニア国物語1) ライオンと魔女 (青空文庫対応txt 表紙・挿絵付)(校正07-07-13).html
ルイス／瀬田貞二訳-(ナルニア国物語2) カスピアン王子のつのぶえ (青空文庫対応txt 表紙・挿絵付)(校正07-07-13).html
ルイス／瀬田貞二訳-(ナルニア国物語3) 朝びらき丸東の海へ (青空文庫対応txt 表紙・挿絵付)(校正07-09-03).html
ルイス／瀬田貞二訳-(ナルニア国物語4) 銀のいす (青空文庫対応txt 表紙・挿絵付)(校正07-11-10).html
ルイス／瀬田貞二訳-(ナルニア国物語5) 馬と少年 (青空文庫対応txt 表紙・挿絵付)(校正07-11-10)(1).html
ルイス／瀬田貞二訳-(ナルニア国物語6) 魔術師のおい (青空文庫対応txt 表紙・挿絵付)(校正08-03-06).html
ルイス／瀬田貞二訳-(ナルニア国物語7) 最後の戦い (青空文庫対応txt 表紙・挿絵付)(校正08-07-25).html
ルソー／太田不二訳-孤独な散歩者の夢想 (青空文庫対応txt)(校正09-06-01).html
ルソー／桑原武夫訳-告白（上） (青空文庫対応txt)(校正08-12-31).html
ルソー／桑原武夫訳-告白（下） (青空文庫対応txt)(校正08-12-31).html
ルナール／窪田般彌訳-にんじん (青空文庫対応txt)(校正08-12-31).html
ルナール／辻昶訳-にんじん (青空文庫対応txt)(校正08-12-07).html
ルブラン／保篠龍緒訳-８１３（上）(ルパン・シリーズ) (青空文庫対応txt)(校正07-06-13).html
ルブラン／保篠龍緒訳-８１３（下）(ルパン・シリーズ) (青空文庫対応txt)(校正07-06-13).html
ルブラン／保篠龍緒訳-八点鐘 (青空文庫対応txt)(校正09-01-11).html
ルブラン／大友徳明訳-オルヌカン城の謎 (青空文庫対応txt)(校正09-05-30).html
ルブラン／大野一道訳-怪盗紳士アルセーヌ・ルパン (青空文庫形式txt)(校正07-06-08).html
ルブラン／山辺雅彦訳-水晶の栓 (青空文庫対応txt)(校正09-05-30).html
ルブラン／水谷準訳-奇巌城(ルパン・シリーズ) (青空文庫対応txt)(校正07-06-13).html
ルブラン／野内良三訳-ルパンの告白 (青空文庫対応txt)(校正09-05-30).html
ルブラン／野内良三訳-ルパン対ホームズ (青空文庫対応txt)(校正07-06-13).html
ルルー／木村庄三郎訳-黄色い部屋の秘密 (青空文庫対応txt)(校正07-06-14).html
レアージュ／澁澤龍彦訳-Ｏ嬢の物語 (青空文庫対応txt)(校正08-12-30).html
レアージュ／鈴木豊訳-Ｏ嬢の物語 (青空文庫対応txt)(校正08-12-06).html
レーニン／角田安正訳-国家と革命 (青空文庫対応txt)(校正09-01-11).html
レニエ-燃え上る青春.html
レマルク／山西英一訳-凱旋門（上） (青空文庫対応txt)(校正08-12-12).html
レマルク／山西英一訳-凱旋門（下） (青空文庫対応txt)(校正08-12-12).html
レマルク／蕗沢忠枝訳-西部戦線異状なし (青空文庫対応txt)(校正09-11-02).html
ローリング-ハリー・ポッターシリーズ 01 ハリー・ポッターと賢者の石(ルビなし).html
ローリング-ハリー・ポッターシリーズ 02 ハリー・ポッターと秘密の部屋.html
ローリング-ハリー・ポッターシリーズ 03 ハリー・ポッターとアズカバンの囚人.html
ローリング-ハリー・ポッターシリーズ 04a ハリー・ポッターと炎のゴブレット(上) (05年09月版).html
ローリング-ハリー・ポッターシリーズ 04b ハリー・ポッターと炎のゴブレット(下).html
ローリング-ハリー・ポッターシリーズ 05a ハリー・ポッターと不死鳥の騎士団(上).html
ローリング-ハリー・ポッターシリーズ 05b ハリー・ポッターと不死鳥の騎士団(下).html
ローリング-ハリー・ポッターシリーズ 06a ハリー・ポッターと謎のプリンス(上).html
ローリング-ハリー・ポッターシリーズ 06b ハリー・ポッターと謎のプリンス(下).html
ローリング-ハリー・ポッターシリーズ 07 ハリー・ポッターと死の秘宝 (暫定訳).html
ろくごまるに-封仙娘娘追宝録・奮闘編01 くちづけよりも熱い拳 (青空文庫対応txt形式).html
ろくごまるに-封仙娘娘追宝録・奮闘編02 切れる女に手を出すな (青空文庫対応txt形式).html
ろくごまるに-封仙娘娘追宝録・奮闘編03 名誉を越えた闘い(1).html
ろくごまるに-封仙娘娘追宝録・奮闘編04 夢の涯 (青空文庫対応txt形式).html
ろくごまるに-封仙娘娘追宝録・奮闘編05 最後の宝貝.html
ろくごまるに-封仙娘娘追宝録01 天を騒がす落とし物(画像軽量化).html
ろくごまるに-封仙娘娘追宝録02 嵐を招く道士たち.html
ろくごまるに-封仙娘娘追宝録03 泥を操るいくじなし.html
ろくごまるに-封仙娘娘追宝録04 夢をまどわす頑固者.html
ろくごまるに-封仙娘娘追宝録05 黒い炎の挑戦者.html
ろくごまるに-封仙娘娘追宝録06 憎みきれない好敵手.html
ろくごまるに-封仙娘娘追宝録07 闇をあざむく龍の影.html
ろくごまるに-封仙娘娘追宝録08 刃を砕く復讐者（上）.html
ろくごまるに-封仙娘娘追宝録09 刃を砕く復讐者（下）.html
ロスタン／岩瀬孝訳-シラノ・ド・ベルジュラック (青空文庫対応txt)(校正09-06-07).html
ロチ-秋の日本.html
ロレンス／吉田健一訳-息子と恋人 上巻 (青空文庫対応txt)(校正08-12-20).html
ロレンス／吉田健一訳-息子と恋人 下巻 (青空文庫対応txt)(校正08-12-20).html
ロレンス／吉田健一訳-息子と恋人 中巻 (青空文庫対応txt)(校正08-12-20).html
ロレンス／飯島淳秀訳-チャタレイ夫人の恋人 (青空文庫対応txt)(校正08-12-06).html
ロンドン／山本政喜訳-白い牙 (青空文庫対応txt)(校正07-06-11).html
ロンドン／山本政喜訳-野性の叫び (青空文庫対応txt)(校正07-06-11).html
ワイルド／三好弘訳-サロメ (青空文庫対応txt)(校正07-06-15).html
ワイルド／渡辺純訳-ドリアン・グレイの肖像 (青空文庫対応txt)(校正09-01-13).html
わかつきひかる-AKUMAで少女 01.html
わかつきひかる-AKUMAで少女 02 ～嵐を呼ぶ転校生～.html
わかつきひかる-ふたかた (青空文庫txt).html
亜瑠-3月の出来事.html
亜瑠-アブナイふたり.html
亜瑠-イカルスの一日.html
亜瑠-バレンタインパニック.html
亜瑠-ミソ汁のための死闘.html
亜瑠-ヤマトレンジャー.html
亜瑠-夏の思い出.html
亜瑠-愛と青春のドタバタ.html
亜瑠-文化衝突.html
伊佐千尋-検  屍 Ｍ・モンローのヘア.html
伊佐千尋-法  廷 弁護士たちの孤独な闘い.html
伊岡瞬-いつか、虹の向こうへ (青空文庫対応txt)(校正06-08-04).html
安井健太郎-ラグナロク 第01巻 黒き獣.html
安岡章太郎-夕陽の河岸 (青空文庫対応txt 表紙付)(校正07-07-31).html
安岡章太郎-犬と歩けば (青空文庫対応txt 表紙付)(校正07-08-01).html
安岡章太郎-犬をえらばば (青空文庫対応txt 表紙付)(校正07-07-31).html
安岡章太郎-良友・悪友 (青空文庫対応txt 表紙付)(校正07-07-31).html
安岡章太郎-花祭 (青空文庫対応txt 表紙付)(校正07-07-31).html
安房直子-童話集 白いおうむの森 (青空文庫対応txt 表紙付)(校正09-01-30).html
安房直子-童話集 銀のくじゃく (青空文庫対応txt 表紙付)(校正09-01-08).html
安田均×下村家惠子-ソード・ワールド・ノベル 死せる神の島(上).html
安田均×下村家惠子-ソード・ワールド・ノベル 死せる神の島(下).html
安藤鶴夫-巷談 本牧亭 (青空文庫対応txt 表紙付)(校正08-01-20).html
安部公房-たとえば、タブの研究.html
安部公房-他人の顔-青空文庫txt形式対応[20090609].html
安部公房-密会.html
安部公房-方舟さくら丸.html
安部公房-書斎をたずねて「新潮社の企画？」.html
安部公房-無関係な死.html
安部公房-砂の女 (青空文庫形式txt)(末尾補完).html
安部公房-第四間氷期-青空文庫txt形式[20060805].html
安部公房-箱男.html
安部公房-赤い繭.html
安部公房-飛ぶ男-青空文庫txt形式対応[20090617].html
安部公房-飢餓同盟.html
安部譲二-ぼくのムショ修業 (表紙付).html
安部譲二-塀の中のプレイ・ボール (表紙付).html
安部譲二-塀の中の懲りない面々 (表紙付).html
安部譲二-塀の中の懲りない面々 2 (表紙付).html
安部譲二-時速十四ノット、東へ (表紙付).html
安部譲二-賞ナシ罰アリ猫もいる (表紙付).html
安部龍太郎-戦国秘譚 神々に告ぐ（上） (青空文庫対応txt 表紙付)(校正09-01-04).html
安部龍太郎-戦国秘譚 神々に告ぐ（下） (青空文庫対応txt 表紙付)(校正09-01-04).html
安野光雅／藤原正彦-世にも美しい日本語入門 (青空文庫対応txt 表紙付)(校正09-01-31).html
綾辻行人-どんどん橋、落ちた[20070709].html
綾辻行人-人形館の殺人.html
綾辻行人-十角館の殺人(校正06-03-16).html
綾辻行人-暗黒館の殺人(上)改訂06-02-08.html
綾辻行人-暗黒館の殺人(下).html
綾辻行人-殺人方程式-切断された死体の問題-.html
綾辻行人-鳴風荘事件 ―殺人方程式Ⅱ―.html
芦辺拓-月蝕姫のキス.html
葵せきな-生徒会の一存 碧陽学園生徒会議事録１.html
葵せきな-生徒会の三振 碧陽学園生徒会議事録３.html
葵せきな-生徒会の二心 碧陽学園生徒会議事録２.html
葵せきな-生徒会の日常 碧陽学園生徒会黙示録１.html
葵せきな-碧陽学園生徒会議事録 販促する生徒会 (青空文庫txt形式 著者ブログに掲載 改行調節) .html
阿久悠-瀬戸内少年野球団 (青空文庫対応txt 表紙付)(校正07-08-02).html
阿久悠-続・瀬戸内少年野球団紅顔期 (青空文庫対応txt 表紙付)(校正07-08-02).html
阿井景子-西郷家の女たち (青空文庫対応txt 表紙付)(校正07-11-25).html
阿佐田哲也-ばいにんぶるーす (青空文庫対応txt 表紙付)(校正07-02-07).html
阿佐田哲也-ヤバ市ヤバ町雀鬼伝１ (青空文庫対応txt 表紙付)(校正07-02-12).html
阿佐田哲也-ヤバ市ヤバ町雀鬼伝２. (青空文庫対応txt 表紙付)(校正07-02-12).html
阿佐田哲也-先天性極楽伝 (青空文庫対応txt 表紙付)(校正07-02-11).html
阿佐田哲也-新麻雀放浪記.html
阿刀田高-ぬり絵の旅 (青空文庫対応txt 表紙付)(校正08-01-09).html
阿刀田高-まじめ半分 (青空文庫対応txt 表紙)(校正09-01-02).html
阿刀田高-三角のあたま (表紙付).html
阿刀田高-仮面の女 (青空文庫対応txt 表紙)(校正09-01-02).html
阿刀田高-幻の舟 (表紙付).html
阿刀田高-待っている男 (青空文庫対応txt 表紙)(校正09-01-02).html
阿刀田高-時のカフェテラス (青空文庫対応txt)(校正07-02-24).html
阿刀田高-楽しい古事記 (青空文庫対応txt 表紙・図表付)(校正09-01-02).html
阿刀田高-江戸禁断らいぶらりい.html
阿刀田高-消えた男 (表紙付).html
阿刀田高-猫の事件 (青空文庫対応txt)(校正07-02-24).html
阿刀田高-異形の地図 (表紙付).html
阿刀田高-空想列車(上) (表紙付).html
阿刀田高-空想列車(下) (表紙付).html
阿刀田高-箱の中 (青空文庫対応txt 表紙付)(校正07-11-25).html
阿刀田高-自選恐怖小説集 心の旅路 (表紙付).html
阿刀田高-花の図鑑（上） (青空文庫対応txt 表紙)(校正09-01-02).html
阿刀田高-花の図鑑（下） (青空文庫対応txt 表紙)(校正09-01-02).html
阿刀田高-花惑い (表紙付).html
阿刀田高-詭弁の話術(青空文庫対応txt 表紙・挿絵付)(校正08-02-13).html
阿刀田高-霧のレクイエム (青空文庫対応txt)(校正06-12-23).html
阿刀田高-響灘 そして十二の短篇 (青空文庫対応txt 表紙付)(校正07-11-25).html
阿川佐和子-笑ってケツカッチン (青空文庫対応txt 表紙付)(校正09-06-11).html
阿川佐和子-走って、ころんで、さあ大変 (青空文庫対応txt 表紙付)(校正08-01-18).html
阿川尚之-アメリカが嫌いですか.html
阿川弘之-南蛮阿房列車 (青空文庫対応txt 表紙付)(校正08-07-02).html
阿川弘之-南蛮阿房第２列車 (青空文庫対応txt 表紙付)(校正08-07-02).html
阿川弘之-山本五十六.html
阿川弘之-末の末っ子 (青空文庫対応txt 表紙付)(校正08-06-18).html
阿川弘之-私記キスカ撤退.html
阿智太郎-僕の血を吸わないで1.html
阿智太郎-僕の血を吸わないで2.html
阿満利麿-日本人はなぜ無宗教なのか (青空文庫対応txt 表紙付)(校正09-01-30).html
阿辻哲次-漢字のなりたち物語 (青空文庫対応txt 表紙・挿絵付)(校正08-08-02).html
阿部牧郎-オフィスラブ――甘い誘惑 (青空文庫対応txt 表紙付)(校正07-12-18).html
阿部牧郎-オフィス街のエロス (青空文庫対応txt).html
阿部牧郎-ビル街の裸族 (青空文庫対応txt)(校正07-12-19).html
阿部牧郎-不倫の戦士たち (青空文庫対応txt).html
阿部牧郎-危険な秋 (青空文庫対応txt).html
阿部牧郎-篠懸の遠い道 (青空文庫対応txt 表紙付)(校正07-12-18).html
阿部牧郎-誘惑街の女たち (青空文庫対応txt 表紙付)(校正07-12-18).html
阿部牧郎-誘惑魔.html
阿部謹也-ハーメルンの笛吹き男 ――伝説とその世界 (青空文庫対応txt 表紙・挿絵付)(校正09-07-01).html
飴村行-粘膜人間 (青空文庫対応txt 表紙付)(校正08-12-30).html
鮎川哲也-りら荘事件 (青空文庫対応txt)(校正07-02-21)..html
鮎川哲也-戌神はなにを見たか.html
鮎川哲也-朱の絶筆 (青空文庫対応txt)(校正07-02-23)..html
鮎川哲也-死者を笞打て (青空文庫対応txt)(校正07-02-21)..html
'''

volume_dir = 'volume2'

files_by_author = get_files_by_author(file_list=file_list)
contents = get_file_links(volume_dir, files_by_author)
print(contents)
